<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"1391ed1e73bbd07f116e3255be228f602541d5bc9536d6be60957d7accb3fc79","plan_job_ref":"Job Staging Image Build & Push #51 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337297164","plan_hash":"c88b018987aca60220e6f372ff194be01f62c2962446d2290285fd990d59cdcf","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      tags_all                           = {
+           "Environment" = "Dev Environment"
        }
#        (16 unchanged attributes hidden)

+       load_balancer {
+           container_name   = "mongo"
+           container_port   = 8080
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_lb.alb will be created
+   resource "aws_lb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = true
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "fastapi-lb-dev"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = [
+           "sg-0ac5d9e923d0871aa",
        ]
+       subnets                                                      = (sensitive value)
+       tags_all                                                     = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 5000
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.alb-tg is tainted, so must be replaced
+/- resource "aws_lb_target_group" "alb-tg" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/fastapi-alb-target-group-for-dev/ee7f4f23fe4ee1db" -> (known after apply)
!~      arn_suffix                         = "targetgroup/fastapi-alb-target-group-for-dev/ee7f4f23fe4ee1db" -> (known after apply)
!~      connection_termination             = false -> (known after apply)
!~      id                                 = "********************************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "fastapi-alb-target-group-for-dev"
+       name_prefix                        = (known after apply)
!~      preserve_client_ip                 = "true" -> (known after apply)
+       protocol_version                   = (known after apply)
-       tags                               = {} -> null
#        (9 unchanged attributes hidden)

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200-399" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTP" -> null
-           timeout             = 6 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 0 -> null
-           enabled         = false -> null
-           type            = "source_ip" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

  # aws_security_group.allow_port_5000 will be updated in-place
!~  resource "aws_security_group" "allow_port_5000" {
        id                     = "sg-0ac5d9e923d0871aa"
        name                   = "open_port_5000"
        tags                   = {}
!~      tags_all               = {
+           "Environment" = "Dev Environment"
        }
#        (7 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #51](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337297164)